<div style="font-size: 30px"><center>자료읽기, 쓰기 그리고 판다스</center></div>

## 목차
1. 파일 읽기 및 쓰기
2. 판다스(pandas)
<li>데이터 프레임 생성 및 읽기</li>
<li>데이터 프레임 인덱싱</li>
<li>데이터 프레임 추가</li>
<li>데이터 프레임 병합</li>
<li>데이터 프레임 쓰기</li>

[Reference]
- 점프투파이썬, https://wikidocs.net/book/1

----------------------------------------------------------------------------------------------------------------

# 자료 읽고 쓰기
<li>Python을 활용하여 다양한 형태의 자료를 읽고 쓸 수 있다.</li>
- 예시. csv, txt, xlsx, words, json, pickle, shp 등등
<li>데이터 수집 작업을 하는 경우 csv, txt, pickle을 가장 많이 사용하게 될 것</li>
<li>엑셀은 이제 그만!</li>
- csv : comma seperate values, 필드를 쉼표로 구분한 텍스트 파일 - 엑셀에서 보기 좋게 읽을 수 있으며 대부분의 데이터는 csv format으로 저장하고 다루게 될 것!  
<br></br>
- txt : text file  
<br></br>
- pickle : 자료형을 파일로 저장하기 위해 사용함. 일반적인 txt로 저장하는 경우, 자료형(list, tuple, dataframe) 등은 저장되지 않음

In [1]:
# directory 확인
import os
print(os.getcwd()) # 현재 작업중인 directory 확인
print(os.listdir()) # 현재 directory에 있는 파일 출력

/Users/jiwonjang/python_tutorial/ve_env/강의자료_크롤링/2020_1월_데이터수집 강의자료
['.DS_Store', '강의자료 ppt', '1. 변수와 자료구조.ipynb', '2. 조건문, 예외처리.ipynb', '3. 파일 읽기,쓰기 그리고 데이터프레임.ipynb', '.ipynb_checkpoints']

In [2]:
# directory 변경
current_directory = os.getcwd()
os.chdir('/Users/jiwonjang/python_tutorial/')
print(os.getcwd())

os.chdir(current_directory)
print(os.getcwd())

/Users/jiwonjang/python_tutorial
/Users/jiwonjang/python_tutorial/ve_env/강의자료_크롤링/2020_1월_데이터수집 강의자료

In [3]:
# 파일 쓰기
# 파일 객체 = open(파일 이름, 파일 열기 모드)
current_directory = os.getcwd()

f = open(current_directory + '/'+'text_file.txt', 'w') 
# w : 쓰기 모드, r : 읽기 모드 , a : 파일의 마지막에 새로운 내용 추가하는 경우
f.close()

In [4]:
current_directory = os.getcwd()

tmpText = 'Hello World!'

f = open(current_directory + '/'+'text_file.txt', 'a')
f.write(tmpText)
f.close()

In [5]:
# 파일 읽기
current_directory = os.getcwd()

f = open(current_directory+'/'+'text_file.txt', 'r')
print(f)
line = f.readline()
print(type(line))
print(line)
f.close()

<_io.TextIOWrapper name='/Users/jiwonjang/python_tutorial/ve_env/강의자료_크롤링/2020_1월_데이터수집 강의자료/text_file.txt' mode='r' encoding='UTF-8'>
<class 'str'>
Hello World!

In [6]:
# 파일 읽기
current_directory = os.getcwd()

f = open(current_directory+'/'+'text_file.txt', 'r')
print(f)
line = f.readlines()
print(type(line))
print(line)
f.close()

<_io.TextIOWrapper name='/Users/jiwonjang/python_tutorial/ve_env/강의자료_크롤링/2020_1월_데이터수집 강의자료/text_file.txt' mode='r' encoding='UTF-8'>
<class 'list'>
['Hello World!']

In [7]:
# 파일 읽기
current_directory = os.getcwd()

f = open(current_directory+'/'+'text_file.txt', 'r')
print(f)
line = f.read()
print(type(line))
print(line)
f.close()

<_io.TextIOWrapper name='/Users/jiwonjang/python_tutorial/ve_env/강의자료_크롤링/2020_1월_데이터수집 강의자료/text_file.txt' mode='r' encoding='UTF-8'>
<class 'str'>
Hello World!

In [8]:
# 파일 읽기
current_directory = os.getcwd()

with open(current_directory+'/'+'text_file.txt', 'r') as f:
    line = f.read()

print(line)

Hello World!

----------------------------------------------------------------------------------------------------------------

# 판다스(pandas)
<li>행과 열로 이루어진 데이터 객체를 만들고 다룰 수 있는 라이브러리 (액셀)</li>

In [64]:
import numpy as np # numpy package를 np로 불러오기
import pandas as pd # pandas package를 pd로 불러오기

In [65]:
# dictionary를 이용하여 dataframe 만들기
tmpData = {'name' : ['Bob', 'Mike', 'Sam', 'Lisa', 'Mary'],
           'year' : [2013, 2014, 2015, 2016, 2017],
           'points' : [1.5, 1.7, 2.6, 2.4, 2.9]
          }

In [66]:
print(type(tmpData))
print(tmpData)

<class 'dict'>
{'name': ['Bob', 'Mike', 'Sam', 'Lisa', 'Mary'], 'year': [2013, 2014, 2015, 2016, 2017], 'points': [1.5, 1.7, 2.6, 2.4, 2.9]}

In [67]:
# pandas 를 이용하여 dataframe 선언하기
DF = pd.DataFrame(tmpData) # 선언하기 앞서, tmpData의 각 value의 길이가 같은지 확인!

In [68]:
DF

   name  year  points
0   Bob  2013     1.5
1  Mike  2014     1.7
2   Sam  2015     2.6
3  Lisa  2016     2.4
4  Mary  2017     2.9

In [69]:
DF.transpose() # 전치

           0     1     2     3     4
name     Bob  Mike   Sam  Lisa  Mary
year    2013  2014  2015  2016  2017
points   1.5   1.7   2.6   2.4   2.9

In [70]:
# dataframe 길이 확인 - row의 갯수 확인
print(len(DF))

# dataframe colum 종류 확인하기
print(DF.columns)

5
Index(['name', 'year', 'points'], dtype='object')

In [71]:
# dataframe 요소 출력
print(DF.values)

[['Bob' 2013 1.5]
 ['Mike' 2014 1.7]
 ['Sam' 2015 2.6]
 ['Lisa' 2016 2.4]
 ['Mary' 2017 2.9]]

In [72]:
tmpValues = DF.values
print(type(tmpValues)) # values의 자료형

<class 'numpy.ndarray'>

### column 추가

In [73]:
DF

   name  year  points
0   Bob  2013     1.5
1  Mike  2014     1.7
2   Sam  2015     2.6
3  Lisa  2016     2.4
4  Mary  2017     2.9

In [74]:
grade = ['A', 'B', 'C', 'D', 'F']
DF['grade'] = grade

In [75]:
DF

   name  year  points grade
0   Bob  2013     1.5     A
1  Mike  2014     1.7     B
2   Sam  2015     2.6     C
3  Lisa  2016     2.4     D
4  Mary  2017     2.9     F

In [76]:
# column reindex
DF.reindex(columns=['year', 'name','points', 'grade'])

   year  name  points grade
0  2013   Bob     1.5     A
1  2014  Mike     1.7     B
2  2015   Sam     2.6     C
3  2016  Lisa     2.4     D
4  2017  Mary     2.9     F

In [77]:
# row reindex
DF.reindex(index=[1,0,2,3,4])

   name  year  points grade
1  Mike  2014     1.7     B
0   Bob  2013     1.5     A
2   Sam  2015     2.6     C
3  Lisa  2016     2.4     D
4  Mary  2017     2.9     F

In [78]:
# Column 제거 1
del DF['grade']

In [79]:
DF

   name  year  points
0   Bob  2013     1.5
1  Mike  2014     1.7
2   Sam  2015     2.6
3  Lisa  2016     2.4
4  Mary  2017     2.9

In [80]:
# # Column 제거 2
DF.drop('points', 1) # 선택 column 이름, 축(0 = 가로, 1 = 세로)

   name  year
0   Bob  2013
1  Mike  2014
2   Sam  2015
3  Lisa  2016
4  Mary  2017

In [81]:
# row 제거 1
DF.drop(4, 0) # 4번째 row 제거

   name  year  points
0   Bob  2013     1.5
1  Mike  2014     1.7
2   Sam  2015     2.6
3  Lisa  2016     2.4

In [82]:
# row 제거 2
DF.drop([0,2], 0) # row에서 0번째, 2번째 row 제거

   name  year  points
1  Mike  2014     1.7
3  Lisa  2016     2.4
4  Mary  2017     2.9

In [83]:
DF

   name  year  points
0   Bob  2013     1.5
1  Mike  2014     1.7
2   Sam  2015     2.6
3  Lisa  2016     2.4
4  Mary  2017     2.9

In [84]:
# 기초통계
DF.describe()

              year    points
count     5.000000  5.000000
mean   2015.000000  2.220000
std       1.581139  0.597495
min    2013.000000  1.500000
25%    2014.000000  1.700000
50%    2015.000000  2.400000
75%    2016.000000  2.600000
max    2017.000000  2.900000

In [85]:
print(type(DF['year'][0]))
print(type(DF['points'][0]))

<class 'numpy.int64'>
<class 'numpy.float64'>

### data frame indexing

In [86]:
# column indexing
DF

   name  year  points
0   Bob  2013     1.5
1  Mike  2014     1.7
2   Sam  2015     2.6
3  Lisa  2016     2.4
4  Mary  2017     2.9

In [87]:
DF['name']

0     Bob
1    Mike
2     Sam
3    Lisa
4    Mary
Name: name, dtype: object

In [88]:
type(DF['name'])

pandas.core.series.Series

In [89]:
DF['name'][0]

'Bob'

In [90]:
DF[['name', 'year']]

   name  year
0   Bob  2013
1  Mike  2014
2   Sam  2015
3  Lisa  2016
4  Mary  2017

In [91]:
# row 인덱싱 - loc는 라벨을 통해 인덱싱 가능
DF.loc[0]

name       Bob
year      2013
points     1.5
Name: 0, dtype: object

In [92]:
DF = pd.DataFrame(tmpData, index=['a','b','c','d','e']) # index 설정

In [93]:
DF

   name  year  points
a   Bob  2013     1.5
b  Mike  2014     1.7
c   Sam  2015     2.6
d  Lisa  2016     2.4
e  Mary  2017     2.9

In [94]:
DF.loc['a']

name       Bob
year      2013
points     1.5
Name: a, dtype: object

In [95]:
# iloc을 이용한 indexing
DF.iloc[0:3,0:3]

   name  year  points
a   Bob  2013     1.5
b  Mike  2014     1.7
c   Sam  2015     2.6

In [96]:
DF.loc['a']

name       Bob
year      2013
points     1.5
Name: a, dtype: object

In [97]:
type(DF.loc['a'])

pandas.core.series.Series

In [98]:
for i in DF.loc['a']:
    print(i)

Bob
2013
1.5

In [71]:
DF.loc[0][0]
# DF.loc[0][1]
# DF.loc[0][2]

2013

In [72]:
DF.loc[:, 'name'] # : -> 전체라는 뚯

0     Bob
1    Mike
2     Sam
3    Lisa
4    Mary
Name: name, dtype: object

In [99]:
tmpList = DF['name']
for i in tmpList:
    print(i)

Bob
Mike
Sam
Lisa
Mary

### 조건을 이용한 칼럼 선택

In [100]:
# dictionary를 이용하여 dataframe 만들기
tmpData = {'name' : ['Bob', 'Mike', 'Sam', 'Lisa', 'Mary'],
           'year' : [2013, 2014, 2015, 2016, 2017],
           'points' : [1.5, 1.7, 2.6, 2.4, 2.9]
          }

DF = pd.DataFrame(tmpData)

In [101]:
DF

   name  year  points
0   Bob  2013     1.5
1  Mike  2014     1.7
2   Sam  2015     2.6
3  Lisa  2016     2.4
4  Mary  2017     2.9

In [102]:
DF['points'] > 2.5

0    False
1    False
2     True
3    False
4     True
Name: points, dtype: bool

In [103]:
DF[DF['points'] > 2.5]

   name  year  points
2   Sam  2015     2.6
4  Mary  2017     2.9

In [104]:
DF['year'] > 2015

0    False
1    False
2    False
3     True
4     True
Name: year, dtype: bool

In [105]:
DF[DF['year'] > 2015]

   name  year  points
3  Lisa  2016     2.4
4  Mary  2017     2.9

In [106]:
(DF['year'] > 2015) & (DF['points'] > 2.5)

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [107]:
DF[(DF['year'] > 2015) & (DF['points'] > 2.5)]

   name  year  points
4  Mary  2017     2.9

In [108]:
# dataframe 추가, 병합, csv 쓰기
tmpData1 = {'name' : ['Bob', 'Mike', 'Sam', 'Lisa', 'Mary'],
           'year' : [2013, 2014, 2015, 2016, 2017],
           'points' : [1.5, 1.7, 2.6, 2.4, 2.9]
          }

DF1 = pd.DataFrame(tmpData1)

In [109]:
tmpData2 = {'name' : ['Son', 'Woody', 'Buzz', 'Alien', 'Shelly'],
           'year' : [2013, 2014, 2015, 2016, 2017],
           'points' : [1.5, 1.7, 2.6, 2.4, 2.9]
          }

DF2 = pd.DataFrame(tmpData2)

In [110]:
DF1

   name  year  points
0   Bob  2013     1.5
1  Mike  2014     1.7
2   Sam  2015     2.6
3  Lisa  2016     2.4
4  Mary  2017     2.9

In [111]:
DF2

     name  year  points
0     Son  2013     1.5
1   Woody  2014     1.7
2    Buzz  2015     2.6
3   Alien  2016     2.4
4  Shelly  2017     2.9

### dataframe 결합

In [117]:
pd.merge(DF1, DF2, on='points') # column - points를 기준으로 두개의 dataframe을 결합

  name_x  year_x  points name_y  year_y
0    Bob    2013     1.5    Son    2013
1   Mike    2014     1.7  Woody    2014
2    Sam    2015     2.6   Buzz    2015
3   Lisa    2016     2.4  Alien    2016

In [118]:
tmpData1 = {'name' : ['Bob', 'Mike', 'Sam', 'Lisa', 'Mary'],
           'year' : [2013, 2014, 2015, 2016, 2017],
           'points' : [1.5, 1.7, 2.6, 2.4, 2.5]
          }

DF1 = pd.DataFrame(tmpData1)

In [119]:
tmpData2 = {'name' : ['Son', 'Woody', 'Buzz', 'Alien', 'Shelly'],
           'year' : [2013, 2014, 2015, 2016, 2017],
           'points' : [1.5, 1.7, 2.6, 2.4, 2.9]
          }

DF2 = pd.DataFrame(tmpData2)

In [120]:
DF1

   name  year  points
0   Bob  2013     1.5
1  Mike  2014     1.7
2   Sam  2015     2.6
3  Lisa  2016     2.4
4  Mary  2017     2.5

In [121]:
DF2

     name  year  points
0     Son  2013     1.5
1   Woody  2014     1.7
2    Buzz  2015     2.6
3   Alien  2016     2.4
4  Shelly  2017     2.9

In [125]:
pd.merge(DF1, DF2)

Empty DataFrame
Columns: [name, year, points]
Index: []

In [127]:
pd.merge(DF1, DF2, on='points')

  name_x  year_x  points name_y  year_y
0    Bob    2013     1.5    Son    2013
1   Mike    2014     1.7  Woody    2014
2    Sam    2015     2.6   Buzz    2015
3   Lisa    2016     2.4  Alien    2016

In [128]:
tmpData1 = {'name' : ['Bob', 'Mike', 'Sam', 'Lisa', 'Mary'],
           'year' : [2013, 2014, 2015, 2016, 2017],
           'points' : [1.5, 1.7, 2.6, 2.4, 2.9]
          }

DF1 = pd.DataFrame(tmpData1)

In [130]:
DF1

   name  year  points
0   Bob  2013     1.5
1  Mike  2014     1.7
2   Sam  2015     2.6
3  Lisa  2016     2.4
4  Mary  2017     2.9

In [129]:
tmpData2 = {'name' : ['Son', 'Woody', 'Buzz', 'Alien', 'Shelly'],
           'year' : [2013, 2014, 2015, 2016, 2017],
           'points' : [1.5, 1.7, 2.6, 2.4, 2.9]
          }

DF2 = pd.DataFrame(tmpData2)

In [131]:
DF2

     name  year  points
0     Son  2013     1.5
1   Woody  2014     1.7
2    Buzz  2015     2.6
3   Alien  2016     2.4
4  Shelly  2017     2.9

In [132]:
pd.merge(DF1, DF2, on='points', how='right') 
# how='right'를 옵션으로 주는 경우, DF1이 기준이 되어 고정되고, DF2는 동일한 키값(여기서는 points column)을 가질 때 결합.

  name_x  year_x  points  name_y  year_y
0    Bob    2013     1.5     Son    2013
1   Mike    2014     1.7   Woody    2014
2    Sam    2015     2.6    Buzz    2015
3   Lisa    2016     2.4   Alien    2016
4   Mary    2017     2.9  Shelly    2017

In [133]:
pd.merge(DF1, DF2, on='points', how='left')
# how='left'를 옵션으로 주는 경우, DF2는 고정된 상태에서, DF1이 동일한 키값을 가질 때 결합.

  name_x  year_x  points  name_y  year_y
0    Bob    2013     1.5     Son    2013
1   Mike    2014     1.7   Woody    2014
2    Sam    2015     2.6    Buzz    2015
3   Lisa    2016     2.4   Alien    2016
4   Mary    2017     2.9  Shelly    2017

In [134]:
# concat - dataframe 연결
pd.concat([DF1, DF2], axis=0) 
# axis = 0 -> row(행) 단위로 결합

     name  year  points
0     Bob  2013     1.5
1    Mike  2014     1.7
2     Sam  2015     2.6
3    Lisa  2016     2.4
4    Mary  2017     2.9
0     Son  2013     1.5
1   Woody  2014     1.7
2    Buzz  2015     2.6
3   Alien  2016     2.4
4  Shelly  2017     2.9

In [135]:
pd.concat([DF1, DF2], axis=1) 
# axis = 1 -> column(열) 단위로 결합 : merge와 같은 효과

   name  year  points    name  year  points
0   Bob  2013     1.5     Son  2013     1.5
1  Mike  2014     1.7   Woody  2014     1.7
2   Sam  2015     2.6    Buzz  2015     2.6
3  Lisa  2016     2.4   Alien  2016     2.4
4  Mary  2017     2.9  Shelly  2017     2.9

In [136]:
# pandas dataframe 읽고 쓰기.
import os
os.getcwd()
TMPDF = pd.concat([DF1, DF2], axis=0)
TMPDF.to_csv('file_name_test.csv') # csv file로 저장, 구분자는 comma(,)가 기본으로 설정되어 있다.
# TMPDF.to_csv(os.getcwd()+'/'+'file_name_test.csv', sep = '|') # 구분자를 | 로 설정

In [137]:
READ_DF = pd.read_csv('/Users/jiwonjang/python_tutorial/ve_env/강의자료_크롤링/file_name_test.csv')
# READ_DF = pd.read_csv('/Users/jiwonjang/python_tutorial/ve_env/강의자료_크롤링/file_name_test.csv', encoding ='') # encoding 문제가 있는 경우, encoding 값을 옵션에 넣어주어야 한다.

In [138]:
READ_DF

   Unnamed: 0    name  year  points
0           0     Bob  2013     1.5
1           1    Mike  2014     1.7
2           2     Sam  2015     2.6
3           3    Lisa  2016     2.4
4           4    Mary  2017     2.9
5           0     Son  2013     1.5
6           1   Woody  2014     1.7
7           2    Buzz  2015     2.6
8           3   Alien  2016     2.4
9           4  Shelly  2017     2.9

### pandas를 이용한 간단한 연산
- 간단한 연산
- 결측값 구하기

In [139]:
# dataframe을 이용한 간단한 연산
tmpData1 = {'name' : ['Bob', 'Mike', 'Sam', 'Lisa', 'Mary'],
           'year' : [2013, 2014, 2015, 2016, 'NA'],
           'points' : [1.5, 1.7, 2.6, 2.4, 2.9]
          }

DF1 = pd.DataFrame(tmpData1)

tmpData2 = {'name' : ['Son', 'Woody', 'Buzz', 'Alien', 'Shelly'],
           'year' : [2013, 2014, 2015, 2016, 2017],
           'points' : [1.5, 1.7, 2.6, 2.4, 2.9]
          }

DF2 = pd.DataFrame(tmpData2)

In [140]:
DF1

   name  year  points
0   Bob  2013     1.5
1  Mike  2014     1.7
2   Sam  2015     2.6
3  Lisa  2016     2.4
4  Mary    NA     2.9

In [141]:
DF2

     name  year  points
0     Son  2013     1.5
1   Woody  2014     1.7
2    Buzz  2015     2.6
3   Alien  2016     2.4
4  Shelly  2017     2.9

In [142]:
DF1['points']+DF2['points']

0    3.0
1    3.4
2    5.2
3    4.8
4    5.8
Name: points, dtype: float64

In [143]:
DF1['points']*DF2['points']

0    2.25
1    2.89
2    6.76
3    5.76
4    8.41
Name: points, dtype: float64

In [144]:
DF1['points']-DF2['points']

0    0.0
1    0.0
2    0.0
3    0.0
4    0.0
Name: points, dtype: float64

In [145]:
DF1['points']/DF2['points']

0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
Name: points, dtype: float64

------------------------------------------------------------------------------------------------

# 연습문제 
(1) list를 활용하여 dataframe 만들기  
(2) dictionary를 활용하여 dataframe 만들기  
(3) 'Popular_Baby_Names.csv' 파일을 pandas dataframe으로 읽고 각 Column의 value_counts() 구하기  
(3-1) 'Popular_Baby_Names.csv' 파일을 pandas dataframe으로 읽고 'Count'를 기준으로 값 정렬하기  
(3-2) 'Popular_Baby_Names.csv' 파일을 pandas dataframe으로 읽고, 각 연도별 데이터프레임을 'Count'를 기준으로 값 정렬하기  
(3-3) 'Popular_Baby_Names.csv' 파일을 pandas dataframe으로 읽고, Asian의 male과 female 각각의 데이터프레임 구하기.